AlbertoRaceup/custom_board_repo/ATC/boards.txt
##############################################################

atc.name=Arduino UNO R4 ATC
atc.build.core=arduino
atc.build.crossprefix=arm-none-eabi-
atc.build.compiler_path={runtime.tools.arm-none-eabi-gcc-7-2017q4.path}/bin/

atc.build.variant=ATC
atc.build.mcu=cortex-m4
atc.build.architecture=cortex-m4
atc.build.fpu=-mfpu=fpv4-sp-d16
atc.build.float-abi=-mfloat-abi=hard

atc.build.board=MINIMA
atc.build.defines=-DF_CPU=48000000 -DARDUINO_UNOR4_MINIMA
atc.vid.0=0x2341
atc.pid.0=0x0069
atc.vid.1=0x2341
atc.pid.1=0x0369
atc.upload_port.0.vid=0x2341
atc.upload_port.0.pid=0x0069
atc.upload_port.1.vid=0x2341
atc.upload_port.1.pid=0x0369

atc.compiler.fsp.defines={build.variant.path}/defines.txt
atc.compiler.fsp.ldflags={build.variant.path}/ldflags.txt
atc.compiler.fsp.cflags=-mthumb "@{compiler.fsp.defines}"
atc.compiler.fsp.cxxflags=-mthumb "@{compiler.fsp.defines}"
atc.compiler.tinyusb.cflags=-DCFG_TUSB_MCU=OPT_MCU_RAXXX
atc.compiler.tinyusb.cxxflags=-DCFG_TUSB_MCU=OPT_MCU_RAXXX
atc.compiler.fsp.includes={build.variant.path}/includes.txt
atc.compiler.fsp.extra_ldflags=--specs=nano.specs -lstdc++ -lsupc++ -lm -lc -lgcc -lnosys
atc.compiler.fsp="{build.variant.path}/libs/libfsp.a"

atc.upload.tool=dfu-util
atc.upload.tool.default=dfu-util
atc.upload.protocol=
atc.upload.transport=
atc.upload.vid=0x2341
atc.upload.pid=0x0369
atc.upload.address=0x00010000
atc.upload.interface=0
atc.upload.use_1200bps_touch=false
atc.upload.wait_for_upload_port=false
atc.upload.native_usb=true
atc.upload.maximum_size=262144
atc.upload.maximum_data_size=32768

atc.debug.server.openocd.scripts.0=interface/{programmer.protocol}.cfg
atc.debug.server.openocd.scripts.1={programmer.transport_script}
atc.debug.server.openocd.scripts.2={runtime.platform.path}/debugger/R7FA4M1AB.cfg
atc.debug.svd_file={runtime.platform.path}/svd/R7FA4M1AB.svd
